announcements/voice-lock-refreshed.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-08-21 Fri 11:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacspeak: An Overview Of Voice-Lock Over The Years</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacspeak: An Overview Of Voice-Lock Over The Years</h1>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Audio formatted output is provided via <code>voice-lock</code> in Emacspeak.
The feature was originally implemented in 1994 and  significan\'tly
overhauled in 2002 (with no change in functionality). Now, in 2015,
the implementation has been reworked to be once again simpler &#x2014; but
with the same functionality.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 1994: Original Implementation</h2>
<div class="outline-text-2" id="text-2">
<p>
Font-lock was a new feature in Emacs 19 &#x2014; it was introduced right
around the time the Emacspeak project was started.
At the time, there  were multiple font-lock packages in
Emacs. Emacspeak implemented <code>voice-lock</code> via a stand-alone module
that attached property <code>personality</code> to buffer contents. The
<code>dtk-speak</code> Text-To-Speech module treated strings annotated with
property <code>personality</code> as an <i>aural display list</i> when producing
spoken output.
</p>

<p>
In  the winter of 1995, I implemented Aural CSS in emacspeak, and
this resulted in module <code>acss.el</code> &#x2014; that module provides a clean
abstraction for defining <i>values</i> that can be assigned to property
<code>personality</code>. Next, the rest of emacspeak was overhauled to
express all <code>voice-lock</code> features via the ACSS abstraction.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 2002 Overhaul</h2>
<div class="outline-text-2" id="text-3">
<p>
With feature <code>font-lock</code> now mature, Emacs itself converged on a
single font-lock module with <code>jit-lock.el</code> providing just-in-time font
locking. This meant that Emacspeak's <code>voice-lock</code> feature could now be
more easily implemented by attaching appropriate advice to lisp
functions <code>put-text-property</code> and friends &#x2014; this led to the deletion
of module <code>voice-lock.el</code> and the creation of module
<code>emacspeak-personality.el</code>.
</p>

<p>
That module provided multiple options for how faces were mapped to
personalities:
</p>

<ul class="org-ul">
<li>Cumulative where  property <code>personality</code> was either appended or
prepended to the list of personalities  at any given position.</li>
<li>Simple: where the new personality directly replaced any previously
applied <code>personality</code> property.</li>
<li>None: Where faces were not mapped to personalities.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> 2015 Overhaul</h2>
<div class="outline-text-2" id="text-4">
<p>
And now, in 2015, the code in module <code>dtk-speak.el</code> that implements
audio-formatting has been overhauled to directly map faces to
personalities.  This implementation can be enabled by setting the
option <code>emacspeak-personality-voiceify-faces</code> provided in module
<code>emacspeak-personality.el</code> to <span class="underline">All</span>.  This means that the new
implementation can co-exist (at least for a while) with the earlier
advice-based implementation from module <code>emacspeak-personality.el</code>.
</p>

<p>
once deemed to be stable, the new implementation will become the
default &#x2014; by changing the default value of
<code>emacspeak-personality-voiceify-faces</code> to <span class="underline">none</span>.
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Summary</h2>
<div class="outline-text-2" id="text-5">
<p>
From an end-user's perspective, nothing has changed in 21 years. From
the perspective of implementing voice-lock for Emacs modules, nothing
has changed &#x2014; all that an Emacspeak extension for a specific package
needs to do to enable <code>voice-lock</code> is to set up a face-&gt;personality
mapping as before via function <code>voice-setup-add-map</code>. Note that
property <code>personality</code> will continue to have higher precedence than
property <code>face</code> with respect to the audio formatting that gets applied
i.e. Emacspeak first consults value of property <code>personality</code>, and if
that is not set, but there is a <code>face</code> property set, then that
face-&gt;personality mapping (if defined) is used as the aural style.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-08-18 Tue&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2015-08-21 Fri 11:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
